examples/medical_build/case_snappy_aorta_class_api/system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      snappyHexMeshDict;
}

castellatedMesh true;
snap true;
addLayers true;

geometry
{
    "inlet.stl"
    {
        type triSurfaceMesh;
        file "inlet.stl";
        name inlet;
    }
    "outlet_0.stl"
    {
        type triSurfaceMesh;
        file "outlet_0.stl";
        name outlet_0;
    }
    "outlet_1.stl"
    {
        type triSurfaceMesh;
        file "outlet_1.stl";
        name outlet_1;
    }
    "wall.stl"
    {
        type triSurfaceMesh;
        file "wall.stl";
        name wall;
    }
};

castellatedMeshControls
{
    maxLocalCells 100000;
    maxGlobalCells 2000000;
    minRefinementCells 10;
    nCellsBetweenLevels 3;
    locationInMesh (223.0 139.0 24.0);
    features
    (
    );
    refinementSurfaces
    {
        inlet { level (2 3); }
        outlet_0 { level (2 3); }
        outlet_1 { level (2 3); }
        wall { level (2 3); }
    }
    refinementRegions
    {
    }
    allowFreeStandingZoneFaces true;
    resolveFeatureAngle 30;
};

snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 30;
    nRelaxIter 5;
    nFeatureSnapIter 10;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
};

addLayersControls
{
    relativeSizes false;
    nGrow 0;
    expansionRatio 1.2;
    finalLayerThickness 0.24883199999999997;
    minThickness 0.041999999999999996;
    featureAngle 60;
    slipFeatureAngle 30;
    nRelaxIter 5;
    nSmoothNormals 1;
    nSmoothSurfaceNormals 1;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
    firstLayerThickness 0.12;
    layers
    {
        "wall"
        {
            nSurfaceLayers 5;
        }
    }
};

meshQualityControls
{
    maxNonOrtho 75;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave 80;
    minVol 1e-13;
    minTetQuality 1e-15;
    minArea -1;
    minTwist 0.02;
    minDeterminant 0.001;
    minFaceWeight 0.05;
    minVolRatio 0.01;
    minTriangleTwist -1;
    minFlatness 0.5;
    nSmoothScale 4;
    errorReduction 0.75;
};

debug 0;

writeFlags (scalarLevels layerSets layerFields);
mergeTolerance 1e-06;