examples/medical_build/case_snappy_aorta_class_api/constant/transportProperties
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location "constant";
    object transportProperties;
}
transportModel Newtonian;
nu [0 2 -1 0 0 0 0] 3.77e-06;
