examples/medical_build/case_snappy_aorta_class_api/system/fvSolution
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location "system";
    object fvSolution;
}
solvers { p { solver GAMG; tolerance 1e-7; relTol 0; } U { solver smoothSolver; smoother symGaussSeidel; tolerance 1e-8; relTol 0; } }
SIMPLE { nNonOrthogonalCorrectors 1; }
